package com.example.a1

import android.content.Intent
import android.os.Bundle
import android.widget.Button
import androidx.appcompat.app.AppCompatActivity
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView

class BrActivity : AppCompatActivity() {
    private lateinit var recyclerView: RecyclerView
    public val selectedIds = mutableListOf<Int>()

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_br)

        recyclerView = findViewById(R.id.brList)
        recyclerView.layoutManager = LinearLayoutManager(this)
        val brs = listOf(
            Br(1, "Хлеб пшеничный из муки высшего сорта", 8.0, 1.5, 50.0, 262.0),
            Br(2, "Хлеб пшеничный из муки 1 сорта", 7.6, 0.9, 49.7, 226.0),
            Br(3, "Хлеб из ржано-пшеничной муки", 6.8, 1.2, 46.4, 215.0),
            Br(4, "Хлеб ржаной", 4.7, 0.7, 49.8, 214.0),
            Br(5, "Хлеб 'Бородинский'", 6.9, 1.3, 40.9, 208.0),
            Br(6, "Хлеб зерновой (мука пшеничная в/с, зерно дробленое)", 8.6, 1.4, 45.1, 228.0),
            Br(7, "Хлеб цельнозерновой из смеси злаков", 13.0, 4.0, 43.0, 265.0),
            Br(8, "Хлебцы Dr.Körner 'Семь злаков'", 10.0, 2.0, 57.0, 290.0),
            Br(9, "Хлебцы Dr.Körner 'Бородинские'", 11.0, 3.0, 52.0, 280.0),
            Br(10, "Хлебцы Dr.Körner 'Гречневые' с витаминами", 11.6, 3.0, 52.4, 283.0),
            Br(11, "Хлебцы Dr.Körner 'Рисовые' с витаминами", 6.0, 1.0, 69.0, 310.0),
            Br(12, "Сдоба", 8.0, 9.0, 63.0, 269.0-450.0),
            Br(13, "Сухари из пшеничной муки", 11.2, 1.4, 72.4, 331.0),
            Br(14, "Мука пшеничная из твердых сортов в/с", 10.8, 1.3, 69.9, 334.0),
            Br(15, "Мука пшеничная в/с", 10.3, 1.1, 70.6, 334.0),
            Br(16, "Мука пшеничная 1 сорта", 10.6, 1.3, 69.0, 330.0),
            Br(17, "Мука пшеничная 2 сорта", 11.6, 1.8, 64.8, 322.0),
            Br(18, "Мука пшеничная обойная", 11.5, 2.2, 61.5, 312.0),
            Br(19, "Мука ржаная сеяная", 6.9, 1.4, 66.3, 305.0),
            Br(20, "Мука ржаная обдирная", 8.9, 1.7, 61.8, 298.0),
            Br(21, "Мука ржаная обойная", 10.7, 1.9, 58.5, 294.0),
            Br(22, "Макаронные изделия из муки твердых сортов в/с", 11.0, 1.3, 70.5, 338.0),
            Br(23, "Макаронные изделия из муки твердых сортов в/с, вареные", 3.6, 0.4, 20.0, 98.0),
            Br(24, "Макаронные изделия в/с", 10.4, 1.1, 69.7, 337.0),
            Br(25, "Макаронные изделия в/с, вареные", 3.5, 0.4, 23.2, 112.0),
            Br(26, "Крупа гречневая ядрица", 12.6, 3.3, 57.1, 308.0),
            Br(27, "Гречка вареная", 4.1, 1.0, 18.5, 100.0),
            Br(28, "Гречневый продел", 9.5, 2.3, 60.4, 300.0),
            Br(29, "Гречка зеленая ('Мистраль')", 13.4, 3.0, 68.0, 328.0),
            Br(30, "Рис белый шлифованный", 7.0, 1.0, 74.0, 333.0),
            Br(31, "Рис белый шлифованный вареный", 2.3, 0.2, 28.7, 130.0),
            Br(32, "Рис длиннозерный нешлифованный (коричневый, бурый)", 7.5, 2.0, 73.0, 340.0),
            Br(33, "Рис нешлифованный (коричневый, бурый) вареный", 2.5, 0.9, 23.0, 112.0),
            Br(34, "Рис красный нешлифованный", 7.5, 3.0, 68.0, 330.0),
            Br(35, "Рис дикий черный (цицания водная)", 14.7, 1.1, 68.7, 357.0),
            Br(36, "Рис дикий черный вареный", 4.0, 0.3, 19.5, 101.0),
            Br(37, "Пшено", 11.5, 3.3, 66.5, 342.0),
            Br(38, "Пшено вареное", 3.5, 1.1, 23.6, 119.0),
            Br(39, "Крупа овсяная", 12.3, 6.1, 59.5, 342.0),
            Br(40, "Овсяные хлопья", 12.3, 6.2, 61.8, 352.0),
            Br(41, "Каша из овсяных хлопьев на воде", 3.0, 1.7, 15.0, 88.0),
            Br(42, "Каша из овсяных хлопьев на молоке", 3.2, 4.1, 14.2, 102.0),
            Br(43, "Толокно овсяное", 12.5, 6.0, 64.9, 363.0),
            Br(44, "Перловая крупа", 9.3, 1.1, 66.9, 315.0),
            Br(45, "Перловая крупа вареная", 3.1, 0.4, 22.2, 109.0),
            Br(46, "Ячневая крупа", 10.0, 1.3, 65.4, 313.0),
            Br(47, "Ячневая крупа вареная", 2.3, 0.3, 15.7, 76.0),
            Br(48, "Крупа пшеничная 'Полтавская'", 11.5, 1.3, 67.9, 329.0),
            Br(49, "Крупа пшеничная 'Полтавская' вареная", 2.7, 0.3, 15.0, 77.0),
            Br(50, "Кукуруза, зерно продовольственное", 10.3, 4.9, 60.0, 325.0),
            Br(51, "Кукурузная крупа", 8.3, 1.2, 71.0, 328.0),
            Br(52, "Манная крупа", 10.3, 1.0, 70.6, 333.0),
            Br(53, "Манная каша на воде", 2.5, 0.2, 16.8, 80.0),
            Br(54, "Манная каша на молоке", 3.0, 3.2, 15.3, 98.0),
            Br(55, "Горох зерно", 20.5, 2.0, 49.5, 298.0),
            Br(56, "Горох целый шлифованный", 22.0, 2.0, 57.0, 330.0),
            Br(57, "Горох колотый", 23.0, 1.6, 48.1, 299.0),
            Br(58, "Горох вареный", 8.3, 0.4, 21.0, 118.0),
            Br(59, "Горошек зеленый свежий", 5.0, 0.2, 8.3, 55.0),
            Br(60, "Маш", 23.9, 1.2, 62.6, 347.0),
            Br(61, "Маш вареный", 7.0, 0.4, 19.2, 105.0),
            Br(62, "Нут", 20.5, 4.3, 63.0, 360.0),
            Br(63, "Нут вареный", 8.9, 2.6, 27.4, 164.0),
            Br(64, "Соя зерно", 36.7, 17.8, 17.3, 364.0),
            Br(65, "Соевые бобы", 36.4, 19.9, 30.1, 446.0),
            Br(66, "Соевые бобы вареные", 16.6, 8.9, 9.9, 173.0),
            Br(67, "Фасоль обыкновенная красная, все виды", 23.5, 0.8, 60.0, 333.0),
            Br(68, "Фасоль красная вареная", 8.7, 0.5, 22.8, 127.0),
            Br(69, "Фасоль стручковая", 2.5, 0.3, 3.0, 23.0),
            Br(70, "Чечевица", 24.6, 1.1, 63.4, 352.0),
            Br(71, "Чечевица вареная", 9.0, 0.4, 20.1, 116.0),
            Br(72, "Чечевица красная", 21.6, 1.1, 48.0, 314.0),
            Br(73, "Чечевица красная колотая персидская ('Мистраль')", 24.7, 1.2, 62.5, 328.0),
            Br(74, "Амарант крупа", 13.6, 7.0, 58.6, 371.0),
            Br(75, "Амарант вареный", 3.8, 1.6, 16.6, 102.0),
            Br(76, "Киноа крупа", 14.1, 6.1, 57.2, 368.0),
            Br(77, "Киноа вареная", 4.4, 1.9, 18.5, 120.0))

        val adapter = BrAdapter(brs) { id ->
            if (!selectedIds.contains(id)) {
                selectedIds.add(id)
            }
            else {
                selectedIds.remove(id) // Убираем id из списка, если он уже был выбран
            }
            println("Selected IDs: $selectedIds") // Для проверки выбранных id
        }

        recyclerView.adapter = adapter

        findViewById<Button>(R.id.br_button).setOnClickListener {
            val intent = Intent(this, DobavActivity::class.java).apply {
                putIntegerArrayListExtra("selected_ids", ArrayList(selectedIds))
            }
            startActivity(intent)
        }
    }
}